In [ ]:
# How machine learning works
# Data gathering -> data dividation -> data cleaning and pre-processing
# Select a ML model -> Model Training -> Model Prediction -> Model perfomance evaluation

In [ ]:
# Data(df) -> x(independent data)+y(dependent or target data)
# x -> x_train,x_test
# y -> y_train,y_test

In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv('/content/covid_toy - covid_toy.csv')
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [6]:
df.isna().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [5]:
df['fever']=df['fever'].fillna(df['fever'].mean())

In [8]:
df.shape

(100, 6)

In [9]:
x=df.drop(columns=['has_covid'])# Independent Data
x.shape

(100, 5)

In [13]:
y=df['has_covid']# Target Data
y.shape

(100,)

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
x_train, x_test, y_train, y_test=train_test_split(x,y,
                                                  test_size=0.2,
                                                  random_state=11)

In [16]:
print('total shape of df:',df.shape)
print('---------------------------')
print('input data shape:',x.shape)
print('x_train data shape:',x_train.shape)
print('x_test data shape:',x_test.shape)
print('---------------------------')
print('target data shape:',y.shape)
print('y_train data shape:',y_train.shape)
print('y_test data shape:',y_test.shape)
print('---------------------------')

total shape of df: (100, 6)
---------------------------
input data shape: (100, 5)
x_train data shape: (80, 5)
x_test data shape: (20, 5)
---------------------------
target data shape: (100,)
y_train data shape: (80,)
y_test data shape: (20,)
---------------------------

In [18]:
df=pd.read_csv('/content/titanic - titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [19]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [25]:
df['Age']=df['Age'].fillna(df['Age'].mean())
df['Fare']=df['Fare'].fillna(df['Fare'].mean())
df=df.drop(columns=['Cabin'])
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [26]:
df.shape

(418, 11)

In [28]:
x=df.drop(columns=['Survived'])
x.shape

(418, 10)

In [30]:
y=df['Survived']
y.shape

(418,)

In [31]:
x_test,x_train,y_test,y_train=train_test_split(x,y,
                                               test_size=0.2,
                                               random_state=13)

In [32]:
print('total shape of df:',df.shape)
print('---------------------------')
print('input data shape:',x.shape)
print('x_train data shape:',x_train.shape)
print('x_test data shape:',x_test.shape)
print('---------------------------')
print('target data shape:',y.shape)
print('y_train data shape:',y_train.shape)
print('y_test data shape:',y_test.shape)
print('---------------------------')

total shape of df: (418, 11)
---------------------------
input data shape: (418, 10)
x_train data shape: (84, 10)
x_test data shape: (334, 10)
---------------------------
target data shape: (418,)
y_train data shape: (84,)
y_test data shape: (334,)
---------------------------

In [34]:
df=pd.read_csv('/content/Attrition - Attrition.csv')
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [35]:
df.isna().sum()

Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EmployeeCount               0
EmployeeNumber              0
EnvironmentSatisfaction     0
Gender                      0
HourlyRate                  0
JobInvolvement              0
JobLevel                    0
JobRole                     0
JobSatisfaction             0
MaritalStatus               0
MonthlyIncome               0
MonthlyRate                 0
NumCompaniesWorked          0
Over18                      0
OverTime                    0
PercentSalaryHike           0
PerformanceRating           0
RelationshipSatisfaction    0
StandardHours               0
StockOptionLevel            0
TotalWorkingYears           0
TrainingTimesLastYear       0
WorkLifeBalance             0
YearsAtCompany              0
YearsInCurrentRole          0
YearsSinceLastPromotion     0
YearsWithCurrManager        0
dtype: int64

In [37]:
df.shape

(1470, 35)

In [40]:
x=df.drop(columns=['Attrition'])
x.shape

(1470, 34)

In [42]:
y=df['Attrition']
y.shape

(1470,)

In [43]:
x_test,x_train,y_test,y_train=train_test_split(x,y,
                                               test_size=0.2,
                                               random_state=19)

In [44]:
print('total shape of df:',df.shape)
print('---------------------------')
print('input data shape:',x.shape)
print('x_train data shape:',x_train.shape)
print('x_test data shape:',x_test.shape)
print('---------------------------')
print('target data shape:',y.shape)
print('y_train data shape:',y_train.shape)
print('y_test data shape:',y_test.shape)
print('---------------------------')

total shape of df: (1470, 35)
---------------------------
input data shape: (1470, 34)
x_train data shape: (294, 34)
x_test data shape: (1176, 34)
---------------------------
target data shape: (1470,)
y_train data shape: (294,)
y_test data shape: (1176,)
---------------------------